# Laboratório de Pandas

## Exercícios Básicos com Pandas

In [137]:
import pandas as pd

df=pd.DataFrame({'a':[11,21,31],'b':[21,22,23]})

Mostre as primeiras 3 linhas do dataframe `df`.

In [142]:
df[:3]
# df.head(3)

    a   b
0  11  21
1  21  22
2  31  23

Mostre a coluna 'a'.

In [122]:
df["a"]

0    11
1    21
2    31
Name: a, dtype: int64

Redefina o dataframe `df` conforme mostrado abaixo.

In [146]:
df=pd.DataFrame({'a':[1,2,1],'b':[1,1,1]})

Mostre apenas os valores únicos da coluna 'a'.

In [147]:
df["a"].nunique()

2

Crie um dataframe contendo apenas as linhas de `df` onde o valor da coluna 'a' é menor do que 2.

In [154]:
# ndf= df[df["a"]<2] # <--- one liner
ndf = pd.DataFrame()
for index, row in df.iterrows():
    if row["a"] < 2:
        ndf[index] = row

## Carregando Dados com Pandas

Para esta parte do laboratório será necessário baixar o arquivo `albums.csv` da página da disciplina no AVA. Salve o arquivo no mesmo diretório onde está gravado este notebook.

Vamos exercitar o processo para ir de um arquivo com valores separados por vírgula (**.csv**) para um dataframe. A variável **csv_path** armazena o caminho do arquivo **.csv** que é usado como um argumento para a função **read_csv**. O resultado é armazenado no objeto **df**.

In [126]:
csv_path = 'albums.csv'
df = pd.read_csv(csv_path)

Nós podemos usar a função `head()` para inspecionar as primeiras linhas do dataframe.

In [127]:
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

Nós podemos acessar a coluna 'Length' e gravar o seu conteúdo em um novo dataframe.

In [128]:
x = df[['Length']]
x

    Length
0  0:42:19
1  0:42:11
2  0:42:49
3  0:57:44
4  0:46:33
5  0:43:08
6  1:15:54
7  0:40:01

Nós também podemos graver o conteúdo da coluna 'Length' em uma _series_. Uma _series_ pode ser considerada como uma dataframe unidimensional.

In [129]:
x = df['Length']
x

0    0:42:19
1    0:42:11
2    0:42:49
3    0:57:44
4    0:46:33
5    0:43:08
6    1:15:54
7    0:40:01
Name: Length, dtype: object

**Exercício:** Atribua o conteúdo da coluna 'Artist' a um novo dataframe e mostre os dados.

In [130]:
w = df[['Artist']]
w

            Artist
0  Michael Jackson
1            AC/DC
2       Pink Floyd
3  Whitney Houston
4        Meat Loaf
5           Eagles
6         Bee Gees
7    Fleetwood Mac

**Exercício:** Atribua o conteúdo da coluna 'Rating' a uma _series_ e mostre os dados.

In [131]:
z = df['Rating']
z

0    10.0
1     9.5
2     9.0
3     8.5
4     8.0
5     7.5
6     7.0
7     6.5
Name: Rating, dtype: float64

Podemos fazer o mesmo para várias colunas; nós apenas colocamos o nome do dataframe, neste caso, **df**, e o nome dos múltiplos cabeçalhos das colunas entre parênteses duplos. O resultado é um novo dataframe composto pelas colunas especificadas:

In [132]:
y=df[['Artist','Length','Genre']]
y

            Artist   Length                        Genre
0  Michael Jackson  0:42:19               pop, rock, R&B
1            AC/DC  0:42:11                    hard rock
2       Pink Floyd  0:42:49             progressive rock
3  Whitney Houston  0:57:44               R&B, soul, pop
4        Meat Loaf  0:46:33  hard rock, progressive rock
5           Eagles  0:43:08   rock, soft rock, folk rock
6         Bee Gees  1:15:54                        disco
7    Fleetwood Mac  0:40:01                    soft rock

Ou ainda:

In [133]:
df[['Album','Released','Length']]

                             Album  Released   Length
0                         Thriller      1982  0:42:19
1                    Back in Black      1980  0:42:11
2        The Dark Side of the Moon      1973  0:42:49
3                    The Bodyguard      1992  0:57:44
4                  Bat Out of Hell      1977  0:46:33
5  Their Greatest Hits (1971-1975)      1976  0:43:08
6             Saturday Night Fever      1977  1:15:54
7                          Rumours      1977  0:40:01

**Exercício:** Atribua à variável `q` um dataframe composto pelas colunas 'Released' e 'Artist', e mostre o conteúdo de `q`.

In [134]:
q=df[['Released','Artist']]
q

   Released           Artist
0      1982  Michael Jackson
1      1980            AC/DC
2      1973       Pink Floyd
3      1992  Whitney Houston
4      1977        Meat Loaf
5      1976           Eagles
6      1977         Bee Gees
7      1977    Fleetwood Mac

### Indexação

Uma forma de acessar elementos individuais de um dataframe é como método `iloc[]`.
Por exemplo, para acessar o elemento da primeira coluna, da primeira linha, podemos usar:

In [135]:
df.iloc[0,0]

'Michael Jackson'

Para acessar a primeira coluna, da segunda linha, escrevemos:

In [44]:
df.iloc[1,0]

'AC/DC'

Para a terceira coluna da segunda linha, temos:

In [45]:
df.iloc[1,2]

1980

Também é possível acessar os elementos usando os nomes das colunas com o método `loc[]`.
Para acessar o elemento da coluna 'Artist' da primeira linha, temos:

In [46]:
df.loc[0,'Artist']

'Michael Jackson'

Para o elemento da coluna 'Released' da primeria linha, temos:

In [47]:
df.loc[0,'Released']

1982

Para o elementos da mesma coluna, na segunda linha, temos:

In [48]:
df.loc[1,'Released']

1980

### Slicing

Também é possível realizar _slicing_, tanto usando-se índices, quanto usando-se nomes de colunas.

O comando abaixo, cria um dataframe contendo as primeiras duas linhas e as primeiras três colunas no dataframe original.

In [49]:
df.iloc[0:2, 0:3]

            Artist          Album  Released
0  Michael Jackson       Thriller      1982
1            AC/DC  Back in Black      1980

O comando abaixo cria um novo dataframe contendo as primeiras 3 linhas e as colunas 'Artist', 'Album' e 'Released', do dataframe original.

In [50]:
df.loc[0:3, 'Artist':'Released']

            Artist                      Album  Released
0  Michael Jackson                   Thriller      1982
1            AC/DC              Back in Black      1980
2       Pink Floyd  The Dark Side of the Moon      1973
3  Whitney Houston              The Bodyguard      1992


**Isso conclui o laboratório de Pandas.**

In [51]:
print(":)")

:)